TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/*@}*/ /* end of group GPIOB_GPRCM */

/** @addtogroup GPIOB
  @{
*/

typedef struct {
       uint32_t RESERVED0[256];
  __IO uint32_t FSUB_0;                            /* !< (@ 0x00000400) Subsciber Port 0 */
  __IO uint32_t FSUB_1;                            /* !< (@ 0x00000404) Subscriber Port 1 */
       uint32_t RESERVED1[15];
  __IO uint32_t FPUB_0;                            /* !< (@ 0x00000444) Publisher Port 0 */
  __IO uint32_t FPUB_1;                            /* !< (@ 0x00000448) Publisher Port 1 */
       uint32_t RESERVED2[237];
  GPIOB_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED3[510];
  __IO uint32_t CLKOVR;                            /* !< (@ 0x00001010) Clock Override */
       uint32_t RESERVED4;
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED5;
  GPIOB_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED6;
  GPIOB_GEN_EVENT0_Regs  GEN_EVENT0;                        /* !< (@ 0x00001050) */
       uint32_t RESERVED7;
  GPIOB_GEN_EVENT1_Regs  GEN_EVENT1;                        /* !< (@ 0x00001080) */
       uint32_t RESERVED8[13];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED9[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
       uint32_t RESERVED10[64];
  __O  uint32_t DOUT3_0;                           /* !< (@ 0x00001200) Data output 3 to 0 */
  __O  uint32_t DOUT7_4;                           /* !< (@ 0x00001204) Data output 7 to 4 */
  __O  uint32_t DOUT11_8;                          /* !< (@ 0x00001208) Data output 11 to 8 */
  __O  uint32_t DOUT15_12;                         /* !< (@ 0x0000120C) Data output 15 to 12 */
  __O  uint32_t DOUT19_16;                         /* !< (@ 0x00001210) Data output 19 to 16 */
  __O  uint32_t DOUT23_20;                         /* !< (@ 0x00001214) Data output 23 to 20 */
  __O  uint32_t DOUT27_24;                         /* !< (@ 0x00001218) Data output 27 to 24 */
  __O  uint32_t DOUT31_28;                         /* !< (@ 0x0000121C) Data output 31 to 28 */
       uint32_t RESERVED11[24];
  __IO uint32_t DOUT31_0;                          /* !< (@ 0x00001280) Data output 31 to 0 */
       uint32_t RESERVED12[3];
  __O  uint32_t DOUTSET31_0;                       /* !< (@ 0x00001290) Data output set 31 to 0 */
       uint32_t RESERVED13[3];
  __O  uint32_t DOUTCLR31_0;                       /* !< (@ 0x000012A0) Data output clear 31 to 0 */
       uint32_t RESERVED14[3];
  __O  uint32_t DOUTTGL31_0;                       /* !< (@ 0x000012B0) Data output toggle 31 to 0 */
       uint32_t RESERVED15[3];
  __IO uint32_t DOE31_0;                           /* !< (@ 0x000012C0) Data output enable 31 to 0 */
       uint32_t RESERVED16[3];
  __O  uint32_t DOESET31_0;                        /* !< (@ 0x000012D0) Data output enable set 31 to 0 */
       uint32_t RESERVED17[3];
  __O  uint32_t DOECLR31_0;                        /* !< (@ 0x000012E0) Data output enable clear 31 to 0 */
       uint32_t RESERVED18[7];
  __I  uint32_t DIN3_0;                            /* !< (@ 0x00001300) Data input 3 to 0 */
  __I  uint32_t DIN7_4;                            /* !< (@ 0x00001304) Data input 7 to 4 */
  __I  uint32_t DIN11_8;                           /* !< (@ 0x00001308) Data input 11 to 8 */
  __I  uint32_t DIN15_12;                          /* !< (@ 0x0000130C) Data input 15 to 12 */
  __I  uint32_t DIN19_16;                          /* !< (@ 0x00001310) Data input 19 to 16 */
  __I  uint32_t DIN23_20;                          /* !< (@ 0x00001314) Data input 23 to 20 */
  __I  uint32_t DIN27_24;                          /* !< (@ 0x00001318) Data input 27 to 24 */
  __I  uint32_t DIN31_28;                          /* !< (@ 0x0000131C) Data input 31 to 28 */
       uint32_t RESERVED19[24];
  __I  uint32_t DIN31_0;                           /* !< (@ 0x00001380) Data input 31 to 0 */
       uint32_t RESERVED20[3];
  __IO uint32_t POLARITY15_0;                      /* !< (@ 0x00001390) Polarity 15 to 0 */
       uint32_t RESERVED21[3];
  __IO uint32_t POLARITY31_16;                     /* !< (@ 0x000013A0) Polarity 31 to 16 */
       uint32_t RESERVED22[23];
  __IO uint32_t CTL;                               /* !< (@ 0x00001400) FAST WAKE GLOBAL EN */
  __IO uint32_t FASTWAKE;                          /* !< (@ 0x00001404) FAST WAKE ENABLE */
       uint32_t RESERVED23[62];
  __IO uint32_t SUB0CFG;                           /* !< (@ 0x00001500) Subscriber 0 configuration */
       uint32_t RESERVED24;
  __IO uint32_t FILTEREN15_0;                      /* !< (@ 0x00001508) Filter Enable 15 to 0 */
  __IO uint32_t FILTEREN31_16;                     /* !< (@ 0x0000150C) Filter Enable 31 to 16 */
  __IO uint32_t DMAMASK;                           /* !< (@ 0x00001510) DMA Write MASK */
       uint32_t RESERVED25[3];
  __IO uint32_t SUB1CFG;                           /* !< (@ 0x00001520) Subscriber 1 configuration */
} GPIOB_Regs;

/*@}*/ /* end of group GPIOB */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* GPIOB Register Control Bits
******************************************************************************/

/* GPIOB_GEN_EVENT1_IIDX Bits */
/* GPIOB_GEN_EVENT1_IIDX[STAT] Bits */
#define GPIOB_GEN_EVENT1_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define GPIOB_GEN_EVENT1_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define GPIOB_GEN_EVENT1_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO16         ((uint32_t)0x00000001U)         /* !< DIO0 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO17         ((uint32_t)0x00000002U)         /* !< DIO1 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO18         ((uint32_t)0x00000003U)         /* !< DIO2 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO19         ((uint32_t)0x00000004U)         /* !< DIO3 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO20         ((uint32_t)0x00000005U)         /* !< DIO4 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO21         ((uint32_t)0x00000006U)         /* !< DIO5 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO22         ((uint32_t)0x00000007U)         /* !< DIO6 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO23         ((uint32_t)0x00000008U)         /* !< DIO7 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO24         ((uint32_t)0x00000009U)         /* !< DIO8 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO25         ((uint32_t)0x0000000AU)         /* !< DIO9 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO26         ((uint32_t)0x0000000BU)         /* !< DIO10 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO27         ((uint32_t)0x0000000CU)         /* !< DIO11 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO28         ((uint32_t)0x0000000DU)         /* !< DIO12 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO29         ((uint32_t)0x0000000EU)         /* !< DIO13 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO30         ((uint32_t)0x0000000FU)         /* !< DIO14 interrupt */
#define GPIOB_GEN_EVENT1_IIDX_STAT_DIO31         ((uint32_t)0x00000010U)         /* !< DIO15 interrupt */

/* GPIOB_GEN_EVENT1_IMASK Bits */
/* GPIOB_GEN_EVENT1_IMASK[DIO16] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO16_OFS         (16)                            /* !< DIO16 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO16_MASK        ((uint32_t)0x00010000U)         /* !< DIO16 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO16_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO16_SET         ((uint32_t)0x00010000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO17] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO17_OFS         (17)                            /* !< DIO17 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO17_MASK        ((uint32_t)0x00020000U)         /* !< DIO17 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO17_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO17_SET         ((uint32_t)0x00020000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO18] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO18_OFS         (18)                            /* !< DIO18 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO18_MASK        ((uint32_t)0x00040000U)         /* !< DIO18 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO18_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO18_SET         ((uint32_t)0x00040000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO19] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO19_OFS         (19)                            /* !< DIO19 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO19_MASK        ((uint32_t)0x00080000U)         /* !< DIO19 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO19_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO19_SET         ((uint32_t)0x00080000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO20] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO20_OFS         (20)                            /* !< DIO20 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO20_MASK        ((uint32_t)0x00100000U)         /* !< DIO20 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO20_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO20_SET         ((uint32_t)0x00100000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO21] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO21_OFS         (21)                            /* !< DIO21 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO21_MASK        ((uint32_t)0x00200000U)         /* !< DIO21 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO21_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO21_SET         ((uint32_t)0x00200000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO22] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO22_OFS         (22)                            /* !< DIO22 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO22_MASK        ((uint32_t)0x00400000U)         /* !< DIO22 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO22_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO22_SET         ((uint32_t)0x00400000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO23] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO23_OFS         (23)                            /* !< DIO23 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO23_MASK        ((uint32_t)0x00800000U)         /* !< DIO23 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO23_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO23_SET         ((uint32_t)0x00800000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO24] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO24_OFS         (24)                            /* !< DIO24 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO24_MASK        ((uint32_t)0x01000000U)         /* !< DIO24 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO24_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO24_SET         ((uint32_t)0x01000000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO25] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO25_OFS         (25)                            /* !< DIO25 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO25_MASK        ((uint32_t)0x02000000U)         /* !< DIO25 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO25_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO25_SET         ((uint32_t)0x02000000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO26] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO26_OFS         (26)                            /* !< DIO26 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO26_MASK        ((uint32_t)0x04000000U)         /* !< DIO26 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO26_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO26_SET         ((uint32_t)0x04000000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO27] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO27_OFS         (27)                            /* !< DIO27 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO27_MASK        ((uint32_t)0x08000000U)         /* !< DIO27 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO27_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO27_SET         ((uint32_t)0x08000000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO28] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO28_OFS         (28)                            /* !< DIO28 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO28_MASK        ((uint32_t)0x10000000U)         /* !< DIO28 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO28_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO28_SET         ((uint32_t)0x10000000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO29] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO29_OFS         (29)                            /* !< DIO29 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO29_MASK        ((uint32_t)0x20000000U)         /* !< DIO29 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO29_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO29_SET         ((uint32_t)0x20000000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO30] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO30_OFS         (30)                            /* !< DIO30 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO30_MASK        ((uint32_t)0x40000000U)         /* !< DIO30 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO30_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO30_SET         ((uint32_t)0x40000000U)         /* !< Event is unmasked */
/* GPIOB_GEN_EVENT1_IMASK[DIO31] Bits */
#define GPIOB_GEN_EVENT1_IMASK_DIO31_OFS         (31)                            /* !< DIO31 Offset */
#define GPIOB_GEN_EVENT1_IMASK_DIO31_MASK        ((uint32_t)0x80000000U)         /* !< DIO31 event mask */
#define GPIOB_GEN_EVENT1_IMASK_DIO31_CLR         ((uint32_t)0x00000000U)         /* !< Event is masked */
#define GPIOB_GEN_EVENT1_IMASK_DIO31_SET         ((uint32_t)0x80000000U)         /* !< Event is unmasked */

/* GPIOB_GEN_EVENT1_RIS Bits */
/* GPIOB_GEN_EVENT1_RIS[DIO16] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO16_OFS           (16)                            /* !< DIO16 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO16_MASK          ((uint32_t)0x00010000U)         /* !< DIO16 event */
#define GPIOB_GEN_EVENT1_RIS_DIO16_CLR           ((uint32_t)0x00000000U)         /* !< DIO16 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO16_SET           ((uint32_t)0x00010000U)         /* !< DIO16 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO17] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO17_OFS           (17)                            /* !< DIO17 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO17_MASK          ((uint32_t)0x00020000U)         /* !< DIO17 event */
#define GPIOB_GEN_EVENT1_RIS_DIO17_CLR           ((uint32_t)0x00000000U)         /* !< DIO17 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO17_SET           ((uint32_t)0x00020000U)         /* !< DIO17 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO18] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO18_OFS           (18)                            /* !< DIO18 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO18_MASK          ((uint32_t)0x00040000U)         /* !< DIO18 event */
#define GPIOB_GEN_EVENT1_RIS_DIO18_CLR           ((uint32_t)0x00000000U)         /* !< DIO18 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO18_SET           ((uint32_t)0x00040000U)         /* !< DIO18 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO19] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO19_OFS           (19)                            /* !< DIO19 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO19_MASK          ((uint32_t)0x00080000U)         /* !< DIO19 event */
#define GPIOB_GEN_EVENT1_RIS_DIO19_CLR           ((uint32_t)0x00000000U)         /* !< DIO19 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO19_SET           ((uint32_t)0x00080000U)         /* !< DIO19 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO20] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO20_OFS           (20)                            /* !< DIO20 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO20_MASK          ((uint32_t)0x00100000U)         /* !< DIO20 event */
#define GPIOB_GEN_EVENT1_RIS_DIO20_CLR           ((uint32_t)0x00000000U)         /* !< DIO20 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO20_SET           ((uint32_t)0x00100000U)         /* !< DIO20 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO21] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO21_OFS           (21)                            /* !< DIO21 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO21_MASK          ((uint32_t)0x00200000U)         /* !< DIO21 event */
#define GPIOB_GEN_EVENT1_RIS_DIO21_CLR           ((uint32_t)0x00000000U)         /* !< DIO21 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO21_SET           ((uint32_t)0x00200000U)         /* !< DIO21 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO22] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO22_OFS           (22)                            /* !< DIO22 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO22_MASK          ((uint32_t)0x00400000U)         /* !< DIO22 event */
#define GPIOB_GEN_EVENT1_RIS_DIO22_CLR           ((uint32_t)0x00000000U)         /* !< DIO22 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO22_SET           ((uint32_t)0x00400000U)         /* !< DIO22 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO23] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO23_OFS           (23)                            /* !< DIO23 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO23_MASK          ((uint32_t)0x00800000U)         /* !< DIO23 event */
#define GPIOB_GEN_EVENT1_RIS_DIO23_CLR           ((uint32_t)0x00000000U)         /* !< DIO23 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO23_SET           ((uint32_t)0x00800000U)         /* !< DIO23 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO24] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO24_OFS           (24)                            /* !< DIO24 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO24_MASK          ((uint32_t)0x01000000U)         /* !< DIO24 event */
#define GPIOB_GEN_EVENT1_RIS_DIO24_CLR           ((uint32_t)0x00000000U)         /* !< DIO24 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO24_SET           ((uint32_t)0x01000000U)         /* !< DIO24 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO25] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO25_OFS           (25)                            /* !< DIO25 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO25_MASK          ((uint32_t)0x02000000U)         /* !< DIO25 event */
#define GPIOB_GEN_EVENT1_RIS_DIO25_CLR           ((uint32_t)0x00000000U)         /* !< DIO25 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO25_SET           ((uint32_t)0x02000000U)         /* !< DIO25 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO26] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO26_OFS           (26)                            /* !< DIO26 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO26_MASK          ((uint32_t)0x04000000U)         /* !< DIO26 event */
#define GPIOB_GEN_EVENT1_RIS_DIO26_CLR           ((uint32_t)0x00000000U)         /* !< DIO26 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO26_SET           ((uint32_t)0x04000000U)         /* !< DIO26 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO27] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO27_OFS           (27)                            /* !< DIO27 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO27_MASK          ((uint32_t)0x08000000U)         /* !< DIO27 event */
#define GPIOB_GEN_EVENT1_RIS_DIO27_CLR           ((uint32_t)0x00000000U)         /* !< DIO27 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO27_SET           ((uint32_t)0x08000000U)         /* !< DIO27 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO28] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO28_OFS           (28)                            /* !< DIO28 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO28_MASK          ((uint32_t)0x10000000U)         /* !< DIO28 event */
#define GPIOB_GEN_EVENT1_RIS_DIO28_CLR           ((uint32_t)0x00000000U)         /* !< DIO28 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO28_SET           ((uint32_t)0x10000000U)         /* !< DIO28 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO29] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO29_OFS           (29)                            /* !< DIO29 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO29_MASK          ((uint32_t)0x20000000U)         /* !< DIO29 event */
#define GPIOB_GEN_EVENT1_RIS_DIO29_CLR           ((uint32_t)0x00000000U)         /* !< DIO29 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO29_SET           ((uint32_t)0x20000000U)         /* !< DIO29 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO30] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO30_OFS           (30)                            /* !< DIO30 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO30_MASK          ((uint32_t)0x40000000U)         /* !< DIO30 event */
#define GPIOB_GEN_EVENT1_RIS_DIO30_CLR           ((uint32_t)0x00000000U)         /* !< DIO30 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO30_SET           ((uint32_t)0x40000000U)         /* !< DIO30 event occurred */
/* GPIOB_GEN_EVENT1_RIS[DIO31] Bits */
#define GPIOB_GEN_EVENT1_RIS_DIO31_OFS           (31)                            /* !< DIO31 Offset */
#define GPIOB_GEN_EVENT1_RIS_DIO31_MASK          ((uint32_t)0x80000000U)         /* !< DIO31 event */
#define GPIOB_GEN_EVENT1_RIS_DIO31_CLR           ((uint32_t)0x00000000U)         /* !< DIO31 event did not occur */
#define GPIOB_GEN_EVENT1_RIS_DIO31_SET           ((uint32_t)0x80000000U)         /* !< DIO31 event occurred */

