TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/* GPIOB_GEN_EVENT1_MIS Bits */
/* GPIOB_GEN_EVENT1_MIS[DIO16] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO16_OFS           (16)                            /* !< DIO16 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO16_MASK          ((uint32_t)0x00010000U)         /* !< DIO16 event */
#define GPIOB_GEN_EVENT1_MIS_DIO16_CLR           ((uint32_t)0x00000000U)         /* !< DIO16 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO16_SET           ((uint32_t)0x00010000U)         /* !< DIO16 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO17] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO17_OFS           (17)                            /* !< DIO17 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO17_MASK          ((uint32_t)0x00020000U)         /* !< DIO17 event */
#define GPIOB_GEN_EVENT1_MIS_DIO17_CLR           ((uint32_t)0x00000000U)         /* !< DIO17 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO17_SET           ((uint32_t)0x00020000U)         /* !< DIO17 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO18] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO18_OFS           (18)                            /* !< DIO18 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO18_MASK          ((uint32_t)0x00040000U)         /* !< DIO18 event */
#define GPIOB_GEN_EVENT1_MIS_DIO18_CLR           ((uint32_t)0x00000000U)         /* !< DIO18 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO18_SET           ((uint32_t)0x00040000U)         /* !< DIO18 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO19] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO19_OFS           (19)                            /* !< DIO19 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO19_MASK          ((uint32_t)0x00080000U)         /* !< DIO19 event */
#define GPIOB_GEN_EVENT1_MIS_DIO19_CLR           ((uint32_t)0x00000000U)         /* !< DIO19 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO19_SET           ((uint32_t)0x00080000U)         /* !< DIO19 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO20] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO20_OFS           (20)                            /* !< DIO20 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO20_MASK          ((uint32_t)0x00100000U)         /* !< DIO20 event */
#define GPIOB_GEN_EVENT1_MIS_DIO20_CLR           ((uint32_t)0x00000000U)         /* !< DIO20 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO20_SET           ((uint32_t)0x00100000U)         /* !< DIO20 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO21] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO21_OFS           (21)                            /* !< DIO21 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO21_MASK          ((uint32_t)0x00200000U)         /* !< DIO21 event */
#define GPIOB_GEN_EVENT1_MIS_DIO21_CLR           ((uint32_t)0x00000000U)         /* !< DIO21 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO21_SET           ((uint32_t)0x00200000U)         /* !< DIO21 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO22] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO22_OFS           (22)                            /* !< DIO22 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO22_MASK          ((uint32_t)0x00400000U)         /* !< DIO22 event */
#define GPIOB_GEN_EVENT1_MIS_DIO22_CLR           ((uint32_t)0x00000000U)         /* !< DIO22 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO22_SET           ((uint32_t)0x00400000U)         /* !< DIO22 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO23] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO23_OFS           (23)                            /* !< DIO23 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO23_MASK          ((uint32_t)0x00800000U)         /* !< DIO23 event */
#define GPIOB_GEN_EVENT1_MIS_DIO23_CLR           ((uint32_t)0x00000000U)         /* !< DIO23 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO23_SET           ((uint32_t)0x00800000U)         /* !< DIO23 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO24] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO24_OFS           (24)                            /* !< DIO24 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO24_MASK          ((uint32_t)0x01000000U)         /* !< DIO24 event */
#define GPIOB_GEN_EVENT1_MIS_DIO24_CLR           ((uint32_t)0x00000000U)         /* !< DIO24 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO24_SET           ((uint32_t)0x01000000U)         /* !< DIO24 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO25] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO25_OFS           (25)                            /* !< DIO25 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO25_MASK          ((uint32_t)0x02000000U)         /* !< DIO25 event */
#define GPIOB_GEN_EVENT1_MIS_DIO25_CLR           ((uint32_t)0x00000000U)         /* !< DIO25 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO25_SET           ((uint32_t)0x02000000U)         /* !< DIO25 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO26] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO26_OFS           (26)                            /* !< DIO26 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO26_MASK          ((uint32_t)0x04000000U)         /* !< DIO26 event */
#define GPIOB_GEN_EVENT1_MIS_DIO26_CLR           ((uint32_t)0x00000000U)         /* !< DIO26 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO26_SET           ((uint32_t)0x04000000U)         /* !< DIO26 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO27] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO27_OFS           (27)                            /* !< DIO27 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO27_MASK          ((uint32_t)0x08000000U)         /* !< DIO27 event */
#define GPIOB_GEN_EVENT1_MIS_DIO27_CLR           ((uint32_t)0x00000000U)         /* !< DIO27 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO27_SET           ((uint32_t)0x08000000U)         /* !< DIO27 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO28] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO28_OFS           (28)                            /* !< DIO28 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO28_MASK          ((uint32_t)0x10000000U)         /* !< DIO28 event */
#define GPIOB_GEN_EVENT1_MIS_DIO28_CLR           ((uint32_t)0x00000000U)         /* !< DIO28 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO28_SET           ((uint32_t)0x10000000U)         /* !< DIO28 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO29] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO29_OFS           (29)                            /* !< DIO29 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO29_MASK          ((uint32_t)0x20000000U)         /* !< DIO29 event */
#define GPIOB_GEN_EVENT1_MIS_DIO29_CLR           ((uint32_t)0x00000000U)         /* !< DIO29 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO29_SET           ((uint32_t)0x20000000U)         /* !< DIO29 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO30] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO30_OFS           (30)                            /* !< DIO30 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO30_MASK          ((uint32_t)0x40000000U)         /* !< DIO30 event */
#define GPIOB_GEN_EVENT1_MIS_DIO30_CLR           ((uint32_t)0x00000000U)         /* !< DIO30 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO30_SET           ((uint32_t)0x40000000U)         /* !< DIO30 event occurred */
/* GPIOB_GEN_EVENT1_MIS[DIO31] Bits */
#define GPIOB_GEN_EVENT1_MIS_DIO31_OFS           (31)                            /* !< DIO31 Offset */
#define GPIOB_GEN_EVENT1_MIS_DIO31_MASK          ((uint32_t)0x80000000U)         /* !< DIO31 event */
#define GPIOB_GEN_EVENT1_MIS_DIO31_CLR           ((uint32_t)0x00000000U)         /* !< DIO31 event did not occur */
#define GPIOB_GEN_EVENT1_MIS_DIO31_SET           ((uint32_t)0x80000000U)         /* !< DIO31 event occurred */

