TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/* GPIOB_GEN_EVENT1_ISET Bits */
/* GPIOB_GEN_EVENT1_ISET[DIO16] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO16_OFS          (16)                            /* !< DIO16 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO16_MASK         ((uint32_t)0x00010000U)         /* !< DIO16 event */
#define GPIOB_GEN_EVENT1_ISET_DIO16_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO16_SET          ((uint32_t)0x00010000U)         /* !< Sets DIO16 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO17] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO17_OFS          (17)                            /* !< DIO17 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO17_MASK         ((uint32_t)0x00020000U)         /* !< DIO17 event */
#define GPIOB_GEN_EVENT1_ISET_DIO17_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO17_SET          ((uint32_t)0x00020000U)         /* !< Sets DIO17 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO18] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO18_OFS          (18)                            /* !< DIO18 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO18_MASK         ((uint32_t)0x00040000U)         /* !< DIO18 event */
#define GPIOB_GEN_EVENT1_ISET_DIO18_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO18_SET          ((uint32_t)0x00040000U)         /* !< Sets DIO18 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO19] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO19_OFS          (19)                            /* !< DIO19 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO19_MASK         ((uint32_t)0x00080000U)         /* !< DIO19 event */
#define GPIOB_GEN_EVENT1_ISET_DIO19_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO19_SET          ((uint32_t)0x00080000U)         /* !< Sets DIO19 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO20] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO20_OFS          (20)                            /* !< DIO20 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO20_MASK         ((uint32_t)0x00100000U)         /* !< DIO20 event */
#define GPIOB_GEN_EVENT1_ISET_DIO20_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO20_SET          ((uint32_t)0x00100000U)         /* !< Sets DIO20 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO21] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO21_OFS          (21)                            /* !< DIO21 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO21_MASK         ((uint32_t)0x00200000U)         /* !< DIO21 event */
#define GPIOB_GEN_EVENT1_ISET_DIO21_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO21_SET          ((uint32_t)0x00200000U)         /* !< Sets DIO21 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO22] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO22_OFS          (22)                            /* !< DIO22 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO22_MASK         ((uint32_t)0x00400000U)         /* !< DIO22 event */
#define GPIOB_GEN_EVENT1_ISET_DIO22_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO22_SET          ((uint32_t)0x00400000U)         /* !< Sets DIO22 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO23] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO23_OFS          (23)                            /* !< DIO23 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO23_MASK         ((uint32_t)0x00800000U)         /* !< DIO23 event */
#define GPIOB_GEN_EVENT1_ISET_DIO23_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO23_SET          ((uint32_t)0x00800000U)         /* !< Sets DIO23 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO24] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO24_OFS          (24)                            /* !< DIO24 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO24_MASK         ((uint32_t)0x01000000U)         /* !< DIO24 event */
#define GPIOB_GEN_EVENT1_ISET_DIO24_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO24_SET          ((uint32_t)0x01000000U)         /* !< Sets DIO24 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO25] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO25_OFS          (25)                            /* !< DIO25 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO25_MASK         ((uint32_t)0x02000000U)         /* !< DIO25 event */
#define GPIOB_GEN_EVENT1_ISET_DIO25_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO25_SET          ((uint32_t)0x02000000U)         /* !< Sets DIO25 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO26] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO26_OFS          (26)                            /* !< DIO26 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO26_MASK         ((uint32_t)0x04000000U)         /* !< DIO26 event */
#define GPIOB_GEN_EVENT1_ISET_DIO26_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO26_SET          ((uint32_t)0x04000000U)         /* !< Sets DIO26 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO27] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO27_OFS          (27)                            /* !< DIO27 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO27_MASK         ((uint32_t)0x08000000U)         /* !< DIO27 event */
#define GPIOB_GEN_EVENT1_ISET_DIO27_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO27_SET          ((uint32_t)0x08000000U)         /* !< Sets DIO27 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO28] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO28_OFS          (28)                            /* !< DIO28 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO28_MASK         ((uint32_t)0x10000000U)         /* !< DIO28 event */
#define GPIOB_GEN_EVENT1_ISET_DIO28_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO28_SET          ((uint32_t)0x10000000U)         /* !< Sets DIO28 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO29] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO29_OFS          (29)                            /* !< DIO29 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO29_MASK         ((uint32_t)0x20000000U)         /* !< DIO29 event */
#define GPIOB_GEN_EVENT1_ISET_DIO29_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO29_SET          ((uint32_t)0x20000000U)         /* !< Sets DIO29 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO30] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO30_OFS          (30)                            /* !< DIO30 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO30_MASK         ((uint32_t)0x40000000U)         /* !< DIO30 event */
#define GPIOB_GEN_EVENT1_ISET_DIO30_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO30_SET          ((uint32_t)0x40000000U)         /* !< Sets DIO30 in RIS register */
/* GPIOB_GEN_EVENT1_ISET[DIO31] Bits */
#define GPIOB_GEN_EVENT1_ISET_DIO31_OFS          (31)                            /* !< DIO31 Offset */
#define GPIOB_GEN_EVENT1_ISET_DIO31_MASK         ((uint32_t)0x80000000U)         /* !< DIO31 event */
#define GPIOB_GEN_EVENT1_ISET_DIO31_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ISET_DIO31_SET          ((uint32_t)0x80000000U)         /* !< Sets DIO31 in RIS register */

/* GPIOB_GEN_EVENT1_ICLR Bits */
/* GPIOB_GEN_EVENT1_ICLR[DIO16] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO16_OFS          (16)                            /* !< DIO16 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO16_MASK         ((uint32_t)0x00010000U)         /* !< DIO16 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO16_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO16_CLR          ((uint32_t)0x00010000U)         /* !< Clears DIO16 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO17] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO17_OFS          (17)                            /* !< DIO17 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO17_MASK         ((uint32_t)0x00020000U)         /* !< DIO17 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO17_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO17_CLR          ((uint32_t)0x00020000U)         /* !< Clears DIO17 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO18] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO18_OFS          (18)                            /* !< DIO18 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO18_MASK         ((uint32_t)0x00040000U)         /* !< DIO18 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO18_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO18_CLR          ((uint32_t)0x00040000U)         /* !< Clears DIO18 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO19] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO19_OFS          (19)                            /* !< DIO19 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO19_MASK         ((uint32_t)0x00080000U)         /* !< DIO19 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO19_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO19_CLR          ((uint32_t)0x00080000U)         /* !< Clears DIO19 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO20] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO20_OFS          (20)                            /* !< DIO20 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO20_MASK         ((uint32_t)0x00100000U)         /* !< DIO20 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO20_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO20_CLR          ((uint32_t)0x00100000U)         /* !< Clears DIO20 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO21] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO21_OFS          (21)                            /* !< DIO21 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO21_MASK         ((uint32_t)0x00200000U)         /* !< DIO21 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO21_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO21_CLR          ((uint32_t)0x00200000U)         /* !< Clears DIO21 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO22] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO22_OFS          (22)                            /* !< DIO22 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO22_MASK         ((uint32_t)0x00400000U)         /* !< DIO22 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO22_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO22_CLR          ((uint32_t)0x00400000U)         /* !< Clears DIO22 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO23] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO23_OFS          (23)                            /* !< DIO23 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO23_MASK         ((uint32_t)0x00800000U)         /* !< DIO23 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO23_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO23_CLR          ((uint32_t)0x00800000U)         /* !< Clears DIO23 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO24] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO24_OFS          (24)                            /* !< DIO24 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO24_MASK         ((uint32_t)0x01000000U)         /* !< DIO24 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO24_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO24_CLR          ((uint32_t)0x01000000U)         /* !< Clears DIO24 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO25] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO25_OFS          (25)                            /* !< DIO25 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO25_MASK         ((uint32_t)0x02000000U)         /* !< DIO25 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO25_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO25_CLR          ((uint32_t)0x02000000U)         /* !< Clears DIO25 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO26] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO26_OFS          (26)                            /* !< DIO26 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO26_MASK         ((uint32_t)0x04000000U)         /* !< DIO26 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO26_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO26_CLR          ((uint32_t)0x04000000U)         /* !< Clears DIO26 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO27] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO27_OFS          (27)                            /* !< DIO27 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO27_MASK         ((uint32_t)0x08000000U)         /* !< DIO27 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO27_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO27_CLR          ((uint32_t)0x08000000U)         /* !< Clears DIO27 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO28] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO28_OFS          (28)                            /* !< DIO28 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO28_MASK         ((uint32_t)0x10000000U)         /* !< DIO28 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO28_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO28_CLR          ((uint32_t)0x10000000U)         /* !< Clears DIO28 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO29] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO29_OFS          (29)                            /* !< DIO29 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO29_MASK         ((uint32_t)0x20000000U)         /* !< DIO29 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO29_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO29_CLR          ((uint32_t)0x20000000U)         /* !< Clears DIO29 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO30] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO30_OFS          (30)                            /* !< DIO30 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO30_MASK         ((uint32_t)0x40000000U)         /* !< DIO30 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO30_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO30_CLR          ((uint32_t)0x40000000U)         /* !< Clears DIO30 in RIS register */
/* GPIOB_GEN_EVENT1_ICLR[DIO31] Bits */
#define GPIOB_GEN_EVENT1_ICLR_DIO31_OFS          (31)                            /* !< DIO31 Offset */
#define GPIOB_GEN_EVENT1_ICLR_DIO31_MASK         ((uint32_t)0x80000000U)         /* !< DIO31 event */
#define GPIOB_GEN_EVENT1_ICLR_DIO31_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_GEN_EVENT1_ICLR_DIO31_CLR          ((uint32_t)0x80000000U)         /* !< Clears DIO31 in RIS register */

/* GPIOB_GEN_EVENT0_IIDX Bits */
/* GPIOB_GEN_EVENT0_IIDX[STAT] Bits */
#define GPIOB_GEN_EVENT0_IIDX_STAT_OFS           (0)                             /* !< STAT Offset */
#define GPIOB_GEN_EVENT0_IIDX_STAT_MASK          ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define GPIOB_GEN_EVENT0_IIDX_STAT_NO_INTR       ((uint32_t)0x00000000U)         /* !< No bit is set means there is no
                                                                                    pending interrupt request */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO0          ((uint32_t)0x00000001U)         /* !< DIO0 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO1          ((uint32_t)0x00000002U)         /* !< DIO1 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO2          ((uint32_t)0x00000003U)         /* !< DIO2 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO3          ((uint32_t)0x00000004U)         /* !< DIO3 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO4          ((uint32_t)0x00000005U)         /* !< DIO4 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO5          ((uint32_t)0x00000006U)         /* !< DIO5 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO6          ((uint32_t)0x00000007U)         /* !< DIO6 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO7          ((uint32_t)0x00000008U)         /* !< DIO7 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO8          ((uint32_t)0x00000009U)         /* !< DIO8 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO9          ((uint32_t)0x0000000AU)         /* !< DIO9 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO10         ((uint32_t)0x0000000BU)         /* !< DIO10 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO11         ((uint32_t)0x0000000CU)         /* !< DIO11 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO12         ((uint32_t)0x0000000DU)         /* !< DIO12 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO13         ((uint32_t)0x0000000EU)         /* !< DIO13 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO14         ((uint32_t)0x0000000FU)         /* !< DIO14 interrupt */
#define GPIOB_GEN_EVENT0_IIDX_STAT_DIO15         ((uint32_t)0x00000010U)         /* !< DIO15 interrupt */

