TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/* GPIOB_CLKOVR Bits */
/* GPIOB_CLKOVR[OVERRIDE] Bits */
#define GPIOB_CLKOVR_OVERRIDE_OFS                (0)                             /* !< OVERRIDE Offset */
#define GPIOB_CLKOVR_OVERRIDE_MASK               ((uint32_t)0x00000001U)         /* !< Unlocks the functionality of
                                                                                    [RUN_STOP] to override the automatic
                                                                                    peripheral clock request */
#define GPIOB_CLKOVR_OVERRIDE_DISABLED           ((uint32_t)0x00000000U)         /* !< Override disabled */
#define GPIOB_CLKOVR_OVERRIDE_ENABLED            ((uint32_t)0x00000001U)         /* !< Override enabled */
/* GPIOB_CLKOVR[RUN_STOP] Bits */
#define GPIOB_CLKOVR_RUN_STOP_OFS                (1)                             /* !< RUN_STOP Offset */
#define GPIOB_CLKOVR_RUN_STOP_MASK               ((uint32_t)0x00000002U)         /* !< If [OVERRIDE] is enabled, this
                                                                                    register is used to manually control
                                                                                    the peripheral's clock request to the
                                                                                    system */
#define GPIOB_CLKOVR_RUN_STOP_RUN                ((uint32_t)0x00000000U)         /* !< Run/ungate functional clock */
#define GPIOB_CLKOVR_RUN_STOP_STOP               ((uint32_t)0x00000002U)         /* !< Stop/gate functional clock */

/* GPIOB_PDBGCTL Bits */
/* GPIOB_PDBGCTL[FREE] Bits */
#define GPIOB_PDBGCTL_FREE_OFS                   (0)                             /* !< FREE Offset */
#define GPIOB_PDBGCTL_FREE_MASK                  ((uint32_t)0x00000001U)         /* !< Free run control */
#define GPIOB_PDBGCTL_FREE_STOP                  ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define GPIOB_PDBGCTL_FREE_RUN                   ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */

/* GPIOB_EVT_MODE Bits */
/* GPIOB_EVT_MODE[INT0_CFG] Bits */
#define GPIOB_EVT_MODE_INT0_CFG_OFS              (0)                             /* !< INT0_CFG Offset */
#define GPIOB_EVT_MODE_INT0_CFG_MASK             ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to [IPSTANDARD.CPU_INT] */
#define GPIOB_EVT_MODE_INT0_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define GPIOB_EVT_MODE_INT0_CFG_SOFTWARE         ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define GPIOB_EVT_MODE_INT0_CFG_HARDWARE         ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* GPIOB_EVT_MODE[EVT1_CFG] Bits */
#define GPIOB_EVT_MODE_EVT1_CFG_OFS              (2)                             /* !< EVT1_CFG Offset */
#define GPIOB_EVT_MODE_EVT1_CFG_MASK             ((uint32_t)0x0000000CU)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.GEN_EVENT0] */
#define GPIOB_EVT_MODE_EVT1_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define GPIOB_EVT_MODE_EVT1_CFG_SOFTWARE         ((uint32_t)0x00000004U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define GPIOB_EVT_MODE_EVT1_CFG_HARDWARE         ((uint32_t)0x00000008U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */
/* GPIOB_EVT_MODE[EVT2_CFG] Bits */
#define GPIOB_EVT_MODE_EVT2_CFG_OFS              (4)                             /* !< EVT2_CFG Offset */
#define GPIOB_EVT_MODE_EVT2_CFG_MASK             ((uint32_t)0x00000030U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.GEN_EVENT1] */
#define GPIOB_EVT_MODE_EVT2_CFG_DISABLE          ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define GPIOB_EVT_MODE_EVT2_CFG_SOFTWARE         ((uint32_t)0x00000010U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define GPIOB_EVT_MODE_EVT2_CFG_HARDWARE         ((uint32_t)0x00000020U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* GPIOB_DESC Bits */
/* GPIOB_DESC[MINREV] Bits */
#define GPIOB_DESC_MINREV_OFS                    (0)                             /* !< MINREV Offset */
#define GPIOB_DESC_MINREV_MASK                   ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define GPIOB_DESC_MINREV_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOB_DESC_MINREV_MAXIMUM                ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* GPIOB_DESC[MAJREV] Bits */
#define GPIOB_DESC_MAJREV_OFS                    (4)                             /* !< MAJREV Offset */
#define GPIOB_DESC_MAJREV_MASK                   ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define GPIOB_DESC_MAJREV_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOB_DESC_MAJREV_MAXIMUM                ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* GPIOB_DESC[FEATUREVER] Bits */
#define GPIOB_DESC_FEATUREVER_OFS                (12)                            /* !< FEATUREVER Offset */
#define GPIOB_DESC_FEATUREVER_MASK               ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define GPIOB_DESC_FEATUREVER_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOB_DESC_FEATUREVER_MAXIMUM            ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* GPIOB_DESC[MODULEID] Bits */
#define GPIOB_DESC_MODULEID_OFS                  (16)                            /* !< MODULEID Offset */
#define GPIOB_DESC_MODULEID_MASK                 ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define GPIOB_DESC_MODULEID_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define GPIOB_DESC_MODULEID_MAXIMUM              ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* GPIOB_DOUT3_0 Bits */
/* GPIOB_DOUT3_0[DIO0] Bits */
#define GPIOB_DOUT3_0_DIO0_OFS                   (0)                             /* !< DIO0 Offset */
#define GPIOB_DOUT3_0_DIO0_MASK                  ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO0 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT3_0_DIO0_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT3_0_DIO0_ONE                   ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOB_DOUT3_0[DIO1] Bits */
#define GPIOB_DOUT3_0_DIO1_OFS                   (8)                             /* !< DIO1 Offset */
#define GPIOB_DOUT3_0_DIO1_MASK                  ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO1 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT3_0_DIO1_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT3_0_DIO1_ONE                   ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOB_DOUT3_0[DIO2] Bits */
#define GPIOB_DOUT3_0_DIO2_OFS                   (16)                            /* !< DIO2 Offset */
#define GPIOB_DOUT3_0_DIO2_MASK                  ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO2 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT3_0_DIO2_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT3_0_DIO2_ONE                   ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOB_DOUT3_0[DIO3] Bits */
#define GPIOB_DOUT3_0_DIO3_OFS                   (24)                            /* !< DIO3 Offset */
#define GPIOB_DOUT3_0_DIO3_MASK                  ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO3 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT3_0_DIO3_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT3_0_DIO3_ONE                   ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIOB_DOUT7_4 Bits */
/* GPIOB_DOUT7_4[DIO4] Bits */
#define GPIOB_DOUT7_4_DIO4_OFS                   (0)                             /* !< DIO4 Offset */
#define GPIOB_DOUT7_4_DIO4_MASK                  ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO4 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT7_4_DIO4_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT7_4_DIO4_ONE                   ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOB_DOUT7_4[DIO5] Bits */
#define GPIOB_DOUT7_4_DIO5_OFS                   (8)                             /* !< DIO5 Offset */
#define GPIOB_DOUT7_4_DIO5_MASK                  ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO5 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT7_4_DIO5_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT7_4_DIO5_ONE                   ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOB_DOUT7_4[DIO6] Bits */
#define GPIOB_DOUT7_4_DIO6_OFS                   (16)                            /* !< DIO6 Offset */
#define GPIOB_DOUT7_4_DIO6_MASK                  ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO6 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT7_4_DIO6_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT7_4_DIO6_ONE                   ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOB_DOUT7_4[DIO7] Bits */
#define GPIOB_DOUT7_4_DIO7_OFS                   (24)                            /* !< DIO7 Offset */
#define GPIOB_DOUT7_4_DIO7_MASK                  ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO7 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT7_4_DIO7_ZERO                  ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT7_4_DIO7_ONE                   ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

