TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/* GPIOB_DOUT11_8 Bits */
/* GPIOB_DOUT11_8[DIO8] Bits */
#define GPIOB_DOUT11_8_DIO8_OFS                  (0)                             /* !< DIO8 Offset */
#define GPIOB_DOUT11_8_DIO8_MASK                 ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO8 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT11_8_DIO8_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT11_8_DIO8_ONE                  ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOB_DOUT11_8[DIO9] Bits */
#define GPIOB_DOUT11_8_DIO9_OFS                  (8)                             /* !< DIO9 Offset */
#define GPIOB_DOUT11_8_DIO9_MASK                 ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO9 when the output is
                                                                                    enabled through DOE31_0 register. */
#define GPIOB_DOUT11_8_DIO9_ZERO                 ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT11_8_DIO9_ONE                  ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOB_DOUT11_8[DIO10] Bits */
#define GPIOB_DOUT11_8_DIO10_OFS                 (16)                            /* !< DIO10 Offset */
#define GPIOB_DOUT11_8_DIO10_MASK                ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO10 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT11_8_DIO10_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT11_8_DIO10_ONE                 ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOB_DOUT11_8[DIO11] Bits */
#define GPIOB_DOUT11_8_DIO11_OFS                 (24)                            /* !< DIO11 Offset */
#define GPIOB_DOUT11_8_DIO11_MASK                ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO11 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT11_8_DIO11_ZERO                ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT11_8_DIO11_ONE                 ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIOB_DOUT15_12 Bits */
/* GPIOB_DOUT15_12[DIO12] Bits */
#define GPIOB_DOUT15_12_DIO12_OFS                (0)                             /* !< DIO12 Offset */
#define GPIOB_DOUT15_12_DIO12_MASK               ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO12 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT15_12_DIO12_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT15_12_DIO12_ONE                ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOB_DOUT15_12[DIO13] Bits */
#define GPIOB_DOUT15_12_DIO13_OFS                (8)                             /* !< DIO13 Offset */
#define GPIOB_DOUT15_12_DIO13_MASK               ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO13 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT15_12_DIO13_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT15_12_DIO13_ONE                ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOB_DOUT15_12[DIO14] Bits */
#define GPIOB_DOUT15_12_DIO14_OFS                (16)                            /* !< DIO14 Offset */
#define GPIOB_DOUT15_12_DIO14_MASK               ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO14 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT15_12_DIO14_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT15_12_DIO14_ONE                ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOB_DOUT15_12[DIO15] Bits */
#define GPIOB_DOUT15_12_DIO15_OFS                (24)                            /* !< DIO15 Offset */
#define GPIOB_DOUT15_12_DIO15_MASK               ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO15 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT15_12_DIO15_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT15_12_DIO15_ONE                ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIOB_DOUT19_16 Bits */
/* GPIOB_DOUT19_16[DIO16] Bits */
#define GPIOB_DOUT19_16_DIO16_OFS                (0)                             /* !< DIO16 Offset */
#define GPIOB_DOUT19_16_DIO16_MASK               ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO16 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT19_16_DIO16_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT19_16_DIO16_ONE                ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOB_DOUT19_16[DIO17] Bits */
#define GPIOB_DOUT19_16_DIO17_OFS                (8)                             /* !< DIO17 Offset */
#define GPIOB_DOUT19_16_DIO17_MASK               ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO17 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT19_16_DIO17_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT19_16_DIO17_ONE                ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOB_DOUT19_16[DIO18] Bits */
#define GPIOB_DOUT19_16_DIO18_OFS                (16)                            /* !< DIO18 Offset */
#define GPIOB_DOUT19_16_DIO18_MASK               ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO18 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT19_16_DIO18_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT19_16_DIO18_ONE                ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOB_DOUT19_16[DIO19] Bits */
#define GPIOB_DOUT19_16_DIO19_OFS                (24)                            /* !< DIO19 Offset */
#define GPIOB_DOUT19_16_DIO19_MASK               ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO19 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT19_16_DIO19_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT19_16_DIO19_ONE                ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

/* GPIOB_DOUT23_20 Bits */
/* GPIOB_DOUT23_20[DIO20] Bits */
#define GPIOB_DOUT23_20_DIO20_OFS                (0)                             /* !< DIO20 Offset */
#define GPIOB_DOUT23_20_DIO20_MASK               ((uint32_t)0x00000001U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO20 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT23_20_DIO20_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT23_20_DIO20_ONE                ((uint32_t)0x00000001U)         /* !< Output is set to 1 */
/* GPIOB_DOUT23_20[DIO21] Bits */
#define GPIOB_DOUT23_20_DIO21_OFS                (8)                             /* !< DIO21 Offset */
#define GPIOB_DOUT23_20_DIO21_MASK               ((uint32_t)0x00000100U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO21 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT23_20_DIO21_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT23_20_DIO21_ONE                ((uint32_t)0x00000100U)         /* !< Output is set to 1 */
/* GPIOB_DOUT23_20[DIO22] Bits */
#define GPIOB_DOUT23_20_DIO22_OFS                (16)                            /* !< DIO22 Offset */
#define GPIOB_DOUT23_20_DIO22_MASK               ((uint32_t)0x00010000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO22 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT23_20_DIO22_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT23_20_DIO22_ONE                ((uint32_t)0x00010000U)         /* !< Output is set to 1 */
/* GPIOB_DOUT23_20[DIO23] Bits */
#define GPIOB_DOUT23_20_DIO23_OFS                (24)                            /* !< DIO23 Offset */
#define GPIOB_DOUT23_20_DIO23_MASK               ((uint32_t)0x01000000U)         /* !< This bit sets the value of the pin
                                                                                    configured as DIO23 when the output
                                                                                    is enabled through DOE31_0 register. */
#define GPIOB_DOUT23_20_DIO23_ZERO               ((uint32_t)0x00000000U)         /* !< Output is set to 0 */
#define GPIOB_DOUT23_20_DIO23_ONE                ((uint32_t)0x01000000U)         /* !< Output is set to 1 */

