TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/* GPIOB_DOECLR31_0 Bits */
/* GPIOB_DOECLR31_0[DIO0] Bits */
#define GPIOB_DOECLR31_0_DIO0_OFS                (0)                             /* !< DIO0 Offset */
#define GPIOB_DOECLR31_0_DIO0_MASK               ((uint32_t)0x00000001U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO0 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO0_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO0_CLR                ((uint32_t)0x00000001U)         /* !< Clears DIO0 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO1] Bits */
#define GPIOB_DOECLR31_0_DIO1_OFS                (1)                             /* !< DIO1 Offset */
#define GPIOB_DOECLR31_0_DIO1_MASK               ((uint32_t)0x00000002U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO1 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO1_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO1_CLR                ((uint32_t)0x00000002U)         /* !< Clears DIO1 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO2] Bits */
#define GPIOB_DOECLR31_0_DIO2_OFS                (2)                             /* !< DIO2 Offset */
#define GPIOB_DOECLR31_0_DIO2_MASK               ((uint32_t)0x00000004U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO2 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO2_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO2_CLR                ((uint32_t)0x00000004U)         /* !< Clears DIO2 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO3] Bits */
#define GPIOB_DOECLR31_0_DIO3_OFS                (3)                             /* !< DIO3 Offset */
#define GPIOB_DOECLR31_0_DIO3_MASK               ((uint32_t)0x00000008U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO3 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO3_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO3_CLR                ((uint32_t)0x00000008U)         /* !< Clears DIO3 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO4] Bits */
#define GPIOB_DOECLR31_0_DIO4_OFS                (4)                             /* !< DIO4 Offset */
#define GPIOB_DOECLR31_0_DIO4_MASK               ((uint32_t)0x00000010U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO4 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO4_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO4_CLR                ((uint32_t)0x00000010U)         /* !< Clears DIO4 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO5] Bits */
#define GPIOB_DOECLR31_0_DIO5_OFS                (5)                             /* !< DIO5 Offset */
#define GPIOB_DOECLR31_0_DIO5_MASK               ((uint32_t)0x00000020U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO5 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO5_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO5_CLR                ((uint32_t)0x00000020U)         /* !< Clears DIO5 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO6] Bits */
#define GPIOB_DOECLR31_0_DIO6_OFS                (6)                             /* !< DIO6 Offset */
#define GPIOB_DOECLR31_0_DIO6_MASK               ((uint32_t)0x00000040U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO6 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO6_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO6_CLR                ((uint32_t)0x00000040U)         /* !< Clears DIO6 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO7] Bits */
#define GPIOB_DOECLR31_0_DIO7_OFS                (7)                             /* !< DIO7 Offset */
#define GPIOB_DOECLR31_0_DIO7_MASK               ((uint32_t)0x00000080U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO7 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO7_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO7_CLR                ((uint32_t)0x00000080U)         /* !< Clears DIO7 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO8] Bits */
#define GPIOB_DOECLR31_0_DIO8_OFS                (8)                             /* !< DIO8 Offset */
#define GPIOB_DOECLR31_0_DIO8_MASK               ((uint32_t)0x00000100U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO8 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO8_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO8_CLR                ((uint32_t)0x00000100U)         /* !< Clears DIO8 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO9] Bits */
#define GPIOB_DOECLR31_0_DIO9_OFS                (9)                             /* !< DIO9 Offset */
#define GPIOB_DOECLR31_0_DIO9_MASK               ((uint32_t)0x00000200U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO9 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO9_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO9_CLR                ((uint32_t)0x00000200U)         /* !< Clears DIO9 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO10] Bits */
#define GPIOB_DOECLR31_0_DIO10_OFS               (10)                            /* !< DIO10 Offset */
#define GPIOB_DOECLR31_0_DIO10_MASK              ((uint32_t)0x00000400U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO10 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO10_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO10_CLR               ((uint32_t)0x00000400U)         /* !< Clears DIO10 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO11] Bits */
#define GPIOB_DOECLR31_0_DIO11_OFS               (11)                            /* !< DIO11 Offset */
#define GPIOB_DOECLR31_0_DIO11_MASK              ((uint32_t)0x00000800U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO11 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO11_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO11_CLR               ((uint32_t)0x00000800U)         /* !< Clears DIO11 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO12] Bits */
#define GPIOB_DOECLR31_0_DIO12_OFS               (12)                            /* !< DIO12 Offset */
#define GPIOB_DOECLR31_0_DIO12_MASK              ((uint32_t)0x00001000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO12 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO12_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO12_CLR               ((uint32_t)0x00001000U)         /* !< Clears DIO12 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO13] Bits */
#define GPIOB_DOECLR31_0_DIO13_OFS               (13)                            /* !< DIO13 Offset */
#define GPIOB_DOECLR31_0_DIO13_MASK              ((uint32_t)0x00002000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO13 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO13_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO13_CLR               ((uint32_t)0x00002000U)         /* !< Clears DIO13 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO14] Bits */
#define GPIOB_DOECLR31_0_DIO14_OFS               (14)                            /* !< DIO14 Offset */
#define GPIOB_DOECLR31_0_DIO14_MASK              ((uint32_t)0x00004000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO14 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO14_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO14_CLR               ((uint32_t)0x00004000U)         /* !< Clears DIO14 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO15] Bits */
#define GPIOB_DOECLR31_0_DIO15_OFS               (15)                            /* !< DIO15 Offset */
#define GPIOB_DOECLR31_0_DIO15_MASK              ((uint32_t)0x00008000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO15 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO15_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO15_CLR               ((uint32_t)0x00008000U)         /* !< Clears DIO15 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO16] Bits */
#define GPIOB_DOECLR31_0_DIO16_OFS               (16)                            /* !< DIO16 Offset */
#define GPIOB_DOECLR31_0_DIO16_MASK              ((uint32_t)0x00010000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO16 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO16_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO16_CLR               ((uint32_t)0x00010000U)         /* !< Clears DIO16 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO17] Bits */
#define GPIOB_DOECLR31_0_DIO17_OFS               (17)                            /* !< DIO17 Offset */
#define GPIOB_DOECLR31_0_DIO17_MASK              ((uint32_t)0x00020000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO17 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO17_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO17_CLR               ((uint32_t)0x00020000U)         /* !< Clears DIO17 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO18] Bits */
#define GPIOB_DOECLR31_0_DIO18_OFS               (18)                            /* !< DIO18 Offset */
#define GPIOB_DOECLR31_0_DIO18_MASK              ((uint32_t)0x00040000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO18 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO18_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO18_CLR               ((uint32_t)0x00040000U)         /* !< Clears DIO18 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO19] Bits */
#define GPIOB_DOECLR31_0_DIO19_OFS               (19)                            /* !< DIO19 Offset */
#define GPIOB_DOECLR31_0_DIO19_MASK              ((uint32_t)0x00080000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO19 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO19_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO19_CLR               ((uint32_t)0x00080000U)         /* !< Clears DIO19 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO20] Bits */
#define GPIOB_DOECLR31_0_DIO20_OFS               (20)                            /* !< DIO20 Offset */
#define GPIOB_DOECLR31_0_DIO20_MASK              ((uint32_t)0x00100000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO20 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO20_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO20_CLR               ((uint32_t)0x00100000U)         /* !< Clears DIO20 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO21] Bits */
#define GPIOB_DOECLR31_0_DIO21_OFS               (21)                            /* !< DIO21 Offset */
#define GPIOB_DOECLR31_0_DIO21_MASK              ((uint32_t)0x00200000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO21 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO21_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO21_CLR               ((uint32_t)0x00200000U)         /* !< Clears DIO21 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO22] Bits */
#define GPIOB_DOECLR31_0_DIO22_OFS               (22)                            /* !< DIO22 Offset */
#define GPIOB_DOECLR31_0_DIO22_MASK              ((uint32_t)0x00400000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO22 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO22_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO22_CLR               ((uint32_t)0x00400000U)         /* !< Clears DIO22 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO23] Bits */
#define GPIOB_DOECLR31_0_DIO23_OFS               (23)                            /* !< DIO23 Offset */
#define GPIOB_DOECLR31_0_DIO23_MASK              ((uint32_t)0x00800000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO23 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO23_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO23_CLR               ((uint32_t)0x00800000U)         /* !< Clears DIO23 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO24] Bits */
#define GPIOB_DOECLR31_0_DIO24_OFS               (24)                            /* !< DIO24 Offset */
#define GPIOB_DOECLR31_0_DIO24_MASK              ((uint32_t)0x01000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO24 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO24_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO24_CLR               ((uint32_t)0x01000000U)         /* !< Clears DIO24 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO25] Bits */
#define GPIOB_DOECLR31_0_DIO25_OFS               (25)                            /* !< DIO25 Offset */
#define GPIOB_DOECLR31_0_DIO25_MASK              ((uint32_t)0x02000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO25 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO25_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO25_CLR               ((uint32_t)0x02000000U)         /* !< Clears DIO25 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO26] Bits */
#define GPIOB_DOECLR31_0_DIO26_OFS               (26)                            /* !< DIO26 Offset */
#define GPIOB_DOECLR31_0_DIO26_MASK              ((uint32_t)0x04000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO26 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO26_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO26_CLR               ((uint32_t)0x04000000U)         /* !< Clears DIO26 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO27] Bits */
#define GPIOB_DOECLR31_0_DIO27_OFS               (27)                            /* !< DIO27 Offset */
#define GPIOB_DOECLR31_0_DIO27_MASK              ((uint32_t)0x08000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO27 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO27_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO27_CLR               ((uint32_t)0x08000000U)         /* !< Clears DIO27 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO28] Bits */
#define GPIOB_DOECLR31_0_DIO28_OFS               (28)                            /* !< DIO28 Offset */
#define GPIOB_DOECLR31_0_DIO28_MASK              ((uint32_t)0x10000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO28 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO28_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO28_CLR               ((uint32_t)0x10000000U)         /* !< Clears DIO28 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO29] Bits */
#define GPIOB_DOECLR31_0_DIO29_OFS               (29)                            /* !< DIO29 Offset */
#define GPIOB_DOECLR31_0_DIO29_MASK              ((uint32_t)0x20000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO29 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO29_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO29_CLR               ((uint32_t)0x20000000U)         /* !< Clears DIO29 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO30] Bits */
#define GPIOB_DOECLR31_0_DIO30_OFS               (30)                            /* !< DIO30 Offset */
#define GPIOB_DOECLR31_0_DIO30_MASK              ((uint32_t)0x40000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO30 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO30_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO30_CLR               ((uint32_t)0x40000000U)         /* !< Clears DIO30 in DOE31_0 */
/* GPIOB_DOECLR31_0[DIO31] Bits */
#define GPIOB_DOECLR31_0_DIO31_OFS               (31)                            /* !< DIO31 Offset */
#define GPIOB_DOECLR31_0_DIO31_MASK              ((uint32_t)0x80000000U)         /* !< Writing 1 to this bit clears the
                                                                                    DIO31 bit in the DOE31_0 register.
                                                                                    Writing 0 has no effect. */
#define GPIOB_DOECLR31_0_DIO31_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< No effect */
#define GPIOB_DOECLR31_0_DIO31_CLR               ((uint32_t)0x80000000U)         /* !< Clears DIO31 in DOE31_0 */

