TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/* GPIOB_DIN3_0 Bits */
/* GPIOB_DIN3_0[DIO0] Bits */
#define GPIOB_DIN3_0_DIO0_OFS                    (0)                             /* !< DIO0 Offset */
#define GPIOB_DIN3_0_DIO0_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO0. */
#define GPIOB_DIN3_0_DIO0_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN3_0_DIO0_ONE                    ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN3_0[DIO1] Bits */
#define GPIOB_DIN3_0_DIO1_OFS                    (8)                             /* !< DIO1 Offset */
#define GPIOB_DIN3_0_DIO1_MASK                   ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO1. */
#define GPIOB_DIN3_0_DIO1_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN3_0_DIO1_ONE                    ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN3_0[DIO2] Bits */
#define GPIOB_DIN3_0_DIO2_OFS                    (16)                            /* !< DIO2 Offset */
#define GPIOB_DIN3_0_DIO2_MASK                   ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO2. */
#define GPIOB_DIN3_0_DIO2_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN3_0_DIO2_ONE                    ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN3_0[DIO3] Bits */
#define GPIOB_DIN3_0_DIO3_OFS                    (24)                            /* !< DIO3 Offset */
#define GPIOB_DIN3_0_DIO3_MASK                   ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO3. */
#define GPIOB_DIN3_0_DIO3_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN3_0_DIO3_ONE                    ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOB_DIN7_4 Bits */
/* GPIOB_DIN7_4[DIO4] Bits */
#define GPIOB_DIN7_4_DIO4_OFS                    (0)                             /* !< DIO4 Offset */
#define GPIOB_DIN7_4_DIO4_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO4. */
#define GPIOB_DIN7_4_DIO4_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN7_4_DIO4_ONE                    ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN7_4[DIO5] Bits */
#define GPIOB_DIN7_4_DIO5_OFS                    (8)                             /* !< DIO5 Offset */
#define GPIOB_DIN7_4_DIO5_MASK                   ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO5. */
#define GPIOB_DIN7_4_DIO5_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN7_4_DIO5_ONE                    ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN7_4[DIO6] Bits */
#define GPIOB_DIN7_4_DIO6_OFS                    (16)                            /* !< DIO6 Offset */
#define GPIOB_DIN7_4_DIO6_MASK                   ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO6. */
#define GPIOB_DIN7_4_DIO6_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN7_4_DIO6_ONE                    ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN7_4[DIO7] Bits */
#define GPIOB_DIN7_4_DIO7_OFS                    (24)                            /* !< DIO7 Offset */
#define GPIOB_DIN7_4_DIO7_MASK                   ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO7. */
#define GPIOB_DIN7_4_DIO7_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN7_4_DIO7_ONE                    ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOB_DIN11_8 Bits */
/* GPIOB_DIN11_8[DIO8] Bits */
#define GPIOB_DIN11_8_DIO8_OFS                   (0)                             /* !< DIO8 Offset */
#define GPIOB_DIN11_8_DIO8_MASK                  ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO8. */
#define GPIOB_DIN11_8_DIO8_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN11_8_DIO8_ONE                   ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN11_8[DIO9] Bits */
#define GPIOB_DIN11_8_DIO9_OFS                   (8)                             /* !< DIO9 Offset */
#define GPIOB_DIN11_8_DIO9_MASK                  ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO9. */
#define GPIOB_DIN11_8_DIO9_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN11_8_DIO9_ONE                   ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN11_8[DIO10] Bits */
#define GPIOB_DIN11_8_DIO10_OFS                  (16)                            /* !< DIO10 Offset */
#define GPIOB_DIN11_8_DIO10_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO10. */
#define GPIOB_DIN11_8_DIO10_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN11_8_DIO10_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN11_8[DIO11] Bits */
#define GPIOB_DIN11_8_DIO11_OFS                  (24)                            /* !< DIO11 Offset */
#define GPIOB_DIN11_8_DIO11_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO11. */
#define GPIOB_DIN11_8_DIO11_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN11_8_DIO11_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOB_DIN15_12 Bits */
/* GPIOB_DIN15_12[DIO12] Bits */
#define GPIOB_DIN15_12_DIO12_OFS                 (0)                             /* !< DIO12 Offset */
#define GPIOB_DIN15_12_DIO12_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO12. */
#define GPIOB_DIN15_12_DIO12_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN15_12_DIO12_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN15_12[DIO13] Bits */
#define GPIOB_DIN15_12_DIO13_OFS                 (8)                             /* !< DIO13 Offset */
#define GPIOB_DIN15_12_DIO13_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO13. */
#define GPIOB_DIN15_12_DIO13_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN15_12_DIO13_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN15_12[DIO14] Bits */
#define GPIOB_DIN15_12_DIO14_OFS                 (16)                            /* !< DIO14 Offset */
#define GPIOB_DIN15_12_DIO14_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO14. */
#define GPIOB_DIN15_12_DIO14_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN15_12_DIO14_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN15_12[DIO15] Bits */
#define GPIOB_DIN15_12_DIO15_OFS                 (24)                            /* !< DIO15 Offset */
#define GPIOB_DIN15_12_DIO15_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO15. */
#define GPIOB_DIN15_12_DIO15_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN15_12_DIO15_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOB_DIN19_16 Bits */
/* GPIOB_DIN19_16[DIO16] Bits */
#define GPIOB_DIN19_16_DIO16_OFS                 (0)                             /* !< DIO16 Offset */
#define GPIOB_DIN19_16_DIO16_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO16. */
#define GPIOB_DIN19_16_DIO16_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN19_16_DIO16_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN19_16[DIO17] Bits */
#define GPIOB_DIN19_16_DIO17_OFS                 (8)                             /* !< DIO17 Offset */
#define GPIOB_DIN19_16_DIO17_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO17. */
#define GPIOB_DIN19_16_DIO17_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN19_16_DIO17_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN19_16[DIO18] Bits */
#define GPIOB_DIN19_16_DIO18_OFS                 (16)                            /* !< DIO18 Offset */
#define GPIOB_DIN19_16_DIO18_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO18. */
#define GPIOB_DIN19_16_DIO18_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN19_16_DIO18_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN19_16[DIO19] Bits */
#define GPIOB_DIN19_16_DIO19_OFS                 (24)                            /* !< DIO19 Offset */
#define GPIOB_DIN19_16_DIO19_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO19. */
#define GPIOB_DIN19_16_DIO19_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN19_16_DIO19_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOB_DIN23_20 Bits */
/* GPIOB_DIN23_20[DIO20] Bits */
#define GPIOB_DIN23_20_DIO20_OFS                 (0)                             /* !< DIO20 Offset */
#define GPIOB_DIN23_20_DIO20_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO20. */
#define GPIOB_DIN23_20_DIO20_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN23_20_DIO20_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN23_20[DIO21] Bits */
#define GPIOB_DIN23_20_DIO21_OFS                 (8)                             /* !< DIO21 Offset */
#define GPIOB_DIN23_20_DIO21_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO21. */
#define GPIOB_DIN23_20_DIO21_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN23_20_DIO21_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN23_20[DIO22] Bits */
#define GPIOB_DIN23_20_DIO22_OFS                 (16)                            /* !< DIO22 Offset */
#define GPIOB_DIN23_20_DIO22_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO22. */
#define GPIOB_DIN23_20_DIO22_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN23_20_DIO22_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN23_20[DIO23] Bits */
#define GPIOB_DIN23_20_DIO23_OFS                 (24)                            /* !< DIO23 Offset */
#define GPIOB_DIN23_20_DIO23_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO23. */
#define GPIOB_DIN23_20_DIO23_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN23_20_DIO23_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOB_DIN27_24 Bits */
/* GPIOB_DIN27_24[DIO24] Bits */
#define GPIOB_DIN27_24_DIO24_OFS                 (0)                             /* !< DIO24 Offset */
#define GPIOB_DIN27_24_DIO24_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO24. */
#define GPIOB_DIN27_24_DIO24_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN27_24_DIO24_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN27_24[DIO25] Bits */
#define GPIOB_DIN27_24_DIO25_OFS                 (8)                             /* !< DIO25 Offset */
#define GPIOB_DIN27_24_DIO25_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO25. */
#define GPIOB_DIN27_24_DIO25_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN27_24_DIO25_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN27_24[DIO26] Bits */
#define GPIOB_DIN27_24_DIO26_OFS                 (16)                            /* !< DIO26 Offset */
#define GPIOB_DIN27_24_DIO26_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO26. */
#define GPIOB_DIN27_24_DIO26_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN27_24_DIO26_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN27_24[DIO27] Bits */
#define GPIOB_DIN27_24_DIO27_OFS                 (24)                            /* !< DIO27 Offset */
#define GPIOB_DIN27_24_DIO27_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO27. */
#define GPIOB_DIN27_24_DIO27_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN27_24_DIO27_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOB_DIN31_28 Bits */
/* GPIOB_DIN31_28[DIO28] Bits */
#define GPIOB_DIN31_28_DIO28_OFS                 (0)                             /* !< DIO28 Offset */
#define GPIOB_DIN31_28_DIO28_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO28. */
#define GPIOB_DIN31_28_DIO28_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN31_28_DIO28_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOB_DIN31_28[DIO29] Bits */
#define GPIOB_DIN31_28_DIO29_OFS                 (8)                             /* !< DIO29 Offset */
#define GPIOB_DIN31_28_DIO29_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO29. */
#define GPIOB_DIN31_28_DIO29_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN31_28_DIO29_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOB_DIN31_28[DIO30] Bits */
#define GPIOB_DIN31_28_DIO30_OFS                 (16)                            /* !< DIO30 Offset */
#define GPIOB_DIN31_28_DIO30_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO30. */
#define GPIOB_DIN31_28_DIO30_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN31_28_DIO30_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOB_DIN31_28[DIO31] Bits */
#define GPIOB_DIN31_28_DIO31_OFS                 (24)                            /* !< DIO31 Offset */
#define GPIOB_DIN31_28_DIO31_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO31. */
#define GPIOB_DIN31_28_DIO31_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOB_DIN31_28_DIO31_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

