TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpiob.h
/* GPIOB_FILTEREN31_16 Bits */
/* GPIOB_FILTEREN31_16[DIN16] Bits */
#define GPIOB_FILTEREN31_16_DIN16_OFS            (0)                             /* !< DIN16 Offset */
#define GPIOB_FILTEREN31_16_DIN16_MASK           ((uint32_t)0x00000003U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN16 */
#define GPIOB_FILTEREN31_16_DIN16_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN16_ONE_CYCLE      ((uint32_t)0x00000001U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN16_THREE_CYCLE    ((uint32_t)0x00000002U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN16_EIGHT_CYCLE    ((uint32_t)0x00000003U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN17] Bits */
#define GPIOB_FILTEREN31_16_DIN17_OFS            (2)                             /* !< DIN17 Offset */
#define GPIOB_FILTEREN31_16_DIN17_MASK           ((uint32_t)0x0000000CU)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN17 */
#define GPIOB_FILTEREN31_16_DIN17_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN17_ONE_CYCLE      ((uint32_t)0x00000004U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN17_THREE_CYCLE    ((uint32_t)0x00000008U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN17_EIGHT_CYCLE    ((uint32_t)0x0000000CU)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN18] Bits */
#define GPIOB_FILTEREN31_16_DIN18_OFS            (4)                             /* !< DIN18 Offset */
#define GPIOB_FILTEREN31_16_DIN18_MASK           ((uint32_t)0x00000030U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN18 */
#define GPIOB_FILTEREN31_16_DIN18_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN18_ONE_CYCLE      ((uint32_t)0x00000010U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN18_THREE_CYCLE    ((uint32_t)0x00000020U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN18_EIGHT_CYCLE    ((uint32_t)0x00000030U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN19] Bits */
#define GPIOB_FILTEREN31_16_DIN19_OFS            (6)                             /* !< DIN19 Offset */
#define GPIOB_FILTEREN31_16_DIN19_MASK           ((uint32_t)0x000000C0U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN19 */
#define GPIOB_FILTEREN31_16_DIN19_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN19_ONE_CYCLE      ((uint32_t)0x00000040U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN19_THREE_CYCLE    ((uint32_t)0x00000080U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN19_EIGHT_CYCLE    ((uint32_t)0x000000C0U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN20] Bits */
#define GPIOB_FILTEREN31_16_DIN20_OFS            (8)                             /* !< DIN20 Offset */
#define GPIOB_FILTEREN31_16_DIN20_MASK           ((uint32_t)0x00000300U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN20 */
#define GPIOB_FILTEREN31_16_DIN20_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN20_ONE_CYCLE      ((uint32_t)0x00000100U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN20_THREE_CYCLE    ((uint32_t)0x00000200U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN20_EIGHT_CYCLE    ((uint32_t)0x00000300U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN21] Bits */
#define GPIOB_FILTEREN31_16_DIN21_OFS            (10)                            /* !< DIN21 Offset */
#define GPIOB_FILTEREN31_16_DIN21_MASK           ((uint32_t)0x00000C00U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN21 */
#define GPIOB_FILTEREN31_16_DIN21_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN21_ONE_CYCLE      ((uint32_t)0x00000400U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN21_THREE_CYCLE    ((uint32_t)0x00000800U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN21_EIGHT_CYCLE    ((uint32_t)0x00000C00U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN22] Bits */
#define GPIOB_FILTEREN31_16_DIN22_OFS            (12)                            /* !< DIN22 Offset */
#define GPIOB_FILTEREN31_16_DIN22_MASK           ((uint32_t)0x00003000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN22 */
#define GPIOB_FILTEREN31_16_DIN22_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN22_ONE_CYCLE      ((uint32_t)0x00001000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN22_THREE_CYCLE    ((uint32_t)0x00002000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN22_EIGHT_CYCLE    ((uint32_t)0x00003000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN23] Bits */
#define GPIOB_FILTEREN31_16_DIN23_OFS            (14)                            /* !< DIN23 Offset */
#define GPIOB_FILTEREN31_16_DIN23_MASK           ((uint32_t)0x0000C000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN23 */
#define GPIOB_FILTEREN31_16_DIN23_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN23_ONE_CYCLE      ((uint32_t)0x00004000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN23_THREE_CYCLE    ((uint32_t)0x00008000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN23_EIGHT_CYCLE    ((uint32_t)0x0000C000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN24] Bits */
#define GPIOB_FILTEREN31_16_DIN24_OFS            (16)                            /* !< DIN24 Offset */
#define GPIOB_FILTEREN31_16_DIN24_MASK           ((uint32_t)0x00030000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN24 */
#define GPIOB_FILTEREN31_16_DIN24_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN24_ONE_CYCLE      ((uint32_t)0x00010000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN24_THREE_CYCLE    ((uint32_t)0x00020000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN24_EIGHT_CYCLE    ((uint32_t)0x00030000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN25] Bits */
#define GPIOB_FILTEREN31_16_DIN25_OFS            (18)                            /* !< DIN25 Offset */
#define GPIOB_FILTEREN31_16_DIN25_MASK           ((uint32_t)0x000C0000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN25 */
#define GPIOB_FILTEREN31_16_DIN25_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN25_ONE_CYCLE      ((uint32_t)0x00040000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN25_THREE_CYCLE    ((uint32_t)0x00080000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN25_EIGHT_CYCLE    ((uint32_t)0x000C0000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN26] Bits */
#define GPIOB_FILTEREN31_16_DIN26_OFS            (20)                            /* !< DIN26 Offset */
#define GPIOB_FILTEREN31_16_DIN26_MASK           ((uint32_t)0x00300000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN26 */
#define GPIOB_FILTEREN31_16_DIN26_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN26_ONE_CYCLE      ((uint32_t)0x00100000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN26_THREE_CYCLE    ((uint32_t)0x00200000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN26_EIGHT_CYCLE    ((uint32_t)0x00300000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN27] Bits */
#define GPIOB_FILTEREN31_16_DIN27_OFS            (22)                            /* !< DIN27 Offset */
#define GPIOB_FILTEREN31_16_DIN27_MASK           ((uint32_t)0x00C00000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN27 */
#define GPIOB_FILTEREN31_16_DIN27_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN27_ONE_CYCLE      ((uint32_t)0x00400000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN27_THREE_CYCLE    ((uint32_t)0x00800000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN27_EIGHT_CYCLE    ((uint32_t)0x00C00000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN28] Bits */
#define GPIOB_FILTEREN31_16_DIN28_OFS            (24)                            /* !< DIN28 Offset */
#define GPIOB_FILTEREN31_16_DIN28_MASK           ((uint32_t)0x03000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN28 */
#define GPIOB_FILTEREN31_16_DIN28_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN28_ONE_CYCLE      ((uint32_t)0x01000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN28_THREE_CYCLE    ((uint32_t)0x02000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN28_EIGHT_CYCLE    ((uint32_t)0x03000000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN29] Bits */
#define GPIOB_FILTEREN31_16_DIN29_OFS            (26)                            /* !< DIN29 Offset */
#define GPIOB_FILTEREN31_16_DIN29_MASK           ((uint32_t)0x0C000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN29 */
#define GPIOB_FILTEREN31_16_DIN29_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN29_ONE_CYCLE      ((uint32_t)0x04000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN29_THREE_CYCLE    ((uint32_t)0x08000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN29_EIGHT_CYCLE    ((uint32_t)0x0C000000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN30] Bits */
#define GPIOB_FILTEREN31_16_DIN30_OFS            (28)                            /* !< DIN30 Offset */
#define GPIOB_FILTEREN31_16_DIN30_MASK           ((uint32_t)0x30000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN30 */
#define GPIOB_FILTEREN31_16_DIN30_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN30_ONE_CYCLE      ((uint32_t)0x10000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN30_THREE_CYCLE    ((uint32_t)0x20000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN30_EIGHT_CYCLE    ((uint32_t)0x30000000U)         /* !< 8 ULPCLK minimum sample */
/* GPIOB_FILTEREN31_16[DIN31] Bits */
#define GPIOB_FILTEREN31_16_DIN31_OFS            (30)                            /* !< DIN31 Offset */
#define GPIOB_FILTEREN31_16_DIN31_MASK           ((uint32_t)0xC0000000U)         /* !< Programmable counter length of
                                                                                    digital glitch filter for DIN31 */
#define GPIOB_FILTEREN31_16_DIN31_DISABLE        ((uint32_t)0x00000000U)         /* !< No additional filter beyond the CDC
                                                                                    synchronization sample */
#define GPIOB_FILTEREN31_16_DIN31_ONE_CYCLE      ((uint32_t)0x40000000U)         /* !< 1 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN31_THREE_CYCLE    ((uint32_t)0x80000000U)         /* !< 3 ULPCLK minimum sample */
#define GPIOB_FILTEREN31_16_DIN31_EIGHT_CYCLE    ((uint32_t)0xC0000000U)         /* !< 8 ULPCLK minimum sample */

